tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_FLEXSPI_SLV.h
/*! @name WRITE_REGISTER_COMMAND0 - Write Register Command 0 Setting */
/*! @{ */

#define FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET_MASK (0xFFFF0000U)
#define FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET_SHIFT (16U)
/*! COMMANDSET - Write Register Command Setting */
#define FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET_SHIFT)) & FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET_MASK)
/*! @} */

/*! @name WRITE_COMMAND - Write Command 1 Setting..Write Command 2 Setting */
/*! @{ */

#define FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET_MASK (0xFFFF0000U)
#define FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET_SHIFT (16U)
/*! COMMANDSET - Write Command 2 Setting */
#define FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET(x)  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET_SHIFT)) & FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET_MASK)
/*! @} */

/*! @name RW_COMMAND_BASE - Read Write Command Address Base */
/*! @{ */

#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1_MASK (0xFFFFU)
#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1_SHIFT (0U)
/*! ADDRBASE1 - Address Base 1 */
#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1_SHIFT)) & FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1_MASK)

#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2_MASK (0xFFFF0000U)
#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2_SHIFT (16U)
/*! ADDRBASE2 - Address Base 2 */
#define FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2_SHIFT)) & FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2_MASK)
/*! @} */

/*! @name CMD_RANGE - Command Suit 1 Range..Command Suit 2 Range */
/*! @{ */

#define FLEXSPI_SLV_CMD_RANGE_RANGE_MASK         (0xFFFFFC00U)
#define FLEXSPI_SLV_CMD_RANGE_RANGE_SHIFT        (10U)
/*! RANGE - Memory Range */
#define FLEXSPI_SLV_CMD_RANGE_RANGE(x)           (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_CMD_RANGE_RANGE_SHIFT)) & FLEXSPI_SLV_CMD_RANGE_RANGE_MASK)
/*! @} */

/*! @name MODULE_STATUS - Module Status */
/*! @{ */

#define FLEXSPI_SLV_MODULE_STATUS_WIP_MASK       (0x1U)
#define FLEXSPI_SLV_MODULE_STATUS_WIP_SHIFT      (0U)
/*! WIP - Write in Progress
 *  0b0..Not busy
 *  0b1..Busy
 */
#define FLEXSPI_SLV_MODULE_STATUS_WIP(x)         (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_STATUS_WIP_SHIFT)) & FLEXSPI_SLV_MODULE_STATUS_WIP_MASK)

#define FLEXSPI_SLV_MODULE_STATUS_AXIREADIDLE_MASK (0x2U)
#define FLEXSPI_SLV_MODULE_STATUS_AXIREADIDLE_SHIFT (1U)
/*! AXIREADIDLE - AXI Read Leader Idle
 *  0b0..Busy
 *  0b1..Idle
 */
#define FLEXSPI_SLV_MODULE_STATUS_AXIREADIDLE(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_STATUS_AXIREADIDLE_SHIFT)) & FLEXSPI_SLV_MODULE_STATUS_AXIREADIDLE_MASK)

#define FLEXSPI_SLV_MODULE_STATUS_REGRWIDLE_MASK (0x4U)
#define FLEXSPI_SLV_MODULE_STATUS_REGRWIDLE_SHIFT (2U)
/*! REGRWIDLE - Register Read Write Idle
 *  0b0..Busy
 *  0b1..Idle
 */
#define FLEXSPI_SLV_MODULE_STATUS_REGRWIDLE(x)   (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_STATUS_REGRWIDLE_SHIFT)) & FLEXSPI_SLV_MODULE_STATUS_REGRWIDLE_MASK)

#define FLEXSPI_SLV_MODULE_STATUS_SEQIDLE_MASK   (0x8U)
#define FLEXSPI_SLV_MODULE_STATUS_SEQIDLE_SHIFT  (3U)
/*! SEQIDLE - SEQ Controller Idle
 *  0b0..Busy
 *  0b1..Idle
 */
#define FLEXSPI_SLV_MODULE_STATUS_SEQIDLE(x)     (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_STATUS_SEQIDLE_SHIFT)) & FLEXSPI_SLV_MODULE_STATUS_SEQIDLE_MASK)

#define FLEXSPI_SLV_MODULE_STATUS_RDOFR_MASK     (0xF0U)
#define FLEXSPI_SLV_MODULE_STATUS_RDOFR_SHIFT    (4U)
/*! RDOFR - Read Out-of-Range Counter */
#define FLEXSPI_SLV_MODULE_STATUS_RDOFR(x)       (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_STATUS_RDOFR_SHIFT)) & FLEXSPI_SLV_MODULE_STATUS_RDOFR_MASK)

#define FLEXSPI_SLV_MODULE_STATUS_WROFR_MASK     (0xF00U)
#define FLEXSPI_SLV_MODULE_STATUS_WROFR_SHIFT    (8U)
/*! WROFR - Write Out-of-Range Counter */
#define FLEXSPI_SLV_MODULE_STATUS_WROFR(x)       (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_STATUS_WROFR_SHIFT)) & FLEXSPI_SLV_MODULE_STATUS_WROFR_MASK)

#define FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIRD_MASK (0x1000U)
#define FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIRD_SHIFT (12U)
/*! ALLOWAXIRD - Allow AXI Read Access
 *  0b0..Denied
 *  0b1..Allowed
 */
#define FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIRD(x)  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIRD_SHIFT)) & FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIRD_MASK)

#define FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIWR_MASK (0x2000U)
#define FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIWR_SHIFT (13U)
/*! ALLOWAXIWR - Allow AXI Write Access
 *  0b0..Denied
 *  0b1..Allowed
 */
#define FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIWR(x)  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIWR_SHIFT)) & FLEXSPI_SLV_MODULE_STATUS_ALLOWAXIWR_MASK)
/*! @} */

/*! @name MODULE_INT - SPI FLR interrupt */
/*! @{ */

#define FLEXSPI_SLV_MODULE_INT_WOF_MASK          (0x1U)
#define FLEXSPI_SLV_MODULE_INT_WOF_SHIFT         (0U)
/*! WOF - Write Overflow Interrupt
 *  0b0..Did not occur
 *  0b1..Occurred
 */
#define FLEXSPI_SLV_MODULE_INT_WOF(x)            (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_INT_WOF_SHIFT)) & FLEXSPI_SLV_MODULE_INT_WOF_MASK)

#define FLEXSPI_SLV_MODULE_INT_RUF_MASK          (0x2U)
#define FLEXSPI_SLV_MODULE_INT_RUF_SHIFT         (1U)
/*! RUF - Read Underflow
 *  0b0..Did not occur
 *  0b1..Occurred
 */
#define FLEXSPI_SLV_MODULE_INT_RUF(x)            (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_INT_RUF_SHIFT)) & FLEXSPI_SLV_MODULE_INT_RUF_MASK)

#define FLEXSPI_SLV_MODULE_INT_ERRCMD_MASK       (0x4U)
#define FLEXSPI_SLV_MODULE_INT_ERRCMD_SHIFT      (2U)
/*! ERRCMD - Error Command
 *  0b0..Not received
 *  0b1..Received
 */
#define FLEXSPI_SLV_MODULE_INT_ERRCMD(x)         (((uint32_t)(((uint32_t)(x)) << FLEXSPI_SLV_MODULE_INT_ERRCMD_SHIFT)) & FLEXSPI_SLV_MODULE_INT_ERRCMD_MASK)
/*! @} */

/*! @name MODULE_INTEN - SPI FLR Interrupt Enable */
/*! @{ */

